// 1. Создайте функцию getEmployeeInfo()
// 2. В функции создайте массив имен сотрудников 5шт (Имена придумать самим)
// 3. В функции создайте массив зарплат сотрудников 5 шт(цифры придумать самим)
// 4. Функция должна принимать 1 аргумент - имя сотрудника
// 5. Функция должна возвращать новый массив, где первый элемент - имя сотрудника, второй - его зарплата
// 6. Для поиска ответа функции нужно найти индекс сотрудника в массиве имен. Зарплату взять с ТЕМ ЖЕ индексом что и имя
// 7. Для возврата из функции создайте массив, методом .push поместите в него имя и зарплату, и через return верните созданный массив
// 8. Если такое имя сотрудника в массиве не найдется - вернуть null

function getEmployeeInfo(name) {
    if (typeof(name) !== 'string' || name.length === 0){
        return null;
    }
    const names = ['Salvador', 'Goga', 'Leonardo', 'Ibragim', 'Alex'];
    const payments = [100, 220, 15, 8800, 1000000];
    let result = [];

    for (let i = 0; i < names.length; i++) {
        if (name === names[i]) {
            result.push(names[i], payments[i]);
        }
    }
    return (result.length !== 0 ? result : null);
}

console.log(getEmployeeInfo(''));