// 1. Инициализировать проект командой npm init, заполнить данные
// 2. Установить локально typescript в проект и настроить в конфиге
// outdir, target, module, include, exclude
// 3. Создать скрипт 'build' для комплияции TS в JS
// 4. Установить Eslint и Prettier с плагином Airbnb для TS
// 5. Создать скрипты для запуска линтера и преттира с фиксами и без
// 6. Установить Husky
// 7. Создать пре-коммит хук для хаски в котором будет проверяться линтер и преттир
// 8. Создать .gitignore, в который добавить node_modules и dist